In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 25
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 82
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [2]:
import numpy as np
import pandas as pd

## Handling Missing Data

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [6]:
string_data.isna() # both NaN and None are treated as NA

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
pd.Series([1, 2])#, None]) #note the dtype is int64

0    1
1    2
dtype: int64

In [8]:
pd.Series([1, 2, None])#, dtype='float64') #note the dataype is float64 after adding None.

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

Table 7.1: NA handling object methods
Method	|Description
|:--------|:---------------------------------------------------------------------------------
dropna	|Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.
fillna	|Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill".
isna	|Return Boolean values indicating which values are missing/NA.
notna	|Negation of isna, returns True for non-NA values and False for NA values.

In [13]:
data[data.notna()] # equivalent to data.drop_na()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]]) # each list is a row
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna() # drop a row with at least one NA

     0    1    2
0  1.0  6.5  3.0

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna(how="all") # drop only rows with all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[0]  # column index.

0    1.0
1    1.0
2    NaN
3    NaN
Name: 0, dtype: float64

In [20]:
data.loc[:,0] # col with index 0

0    1.0
1    1.0
2    NaN
3    NaN
Name: 0, dtype: float64

In [21]:
data.iloc[:,0] # col with integer index 0

0    1.0
1    1.0
2    NaN
3    NaN
Name: 0, dtype: float64

In [22]:
data.iloc[0] # row 0 compared to data[0]: col 0.

0    1.0
1    6.5
2    3.0
Name: 0, dtype: float64

In [23]:
data.loc[0] # row with index 0

0    1.0
1    6.5
2    3.0
Name: 0, dtype: float64

In [24]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:

data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -2.046362 -0.444316  0.557301
1  1.635631  2.154904  0.925215
2  0.487818 -0.029588 -1.964850
3 -1.689219 -0.398704  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [5]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0 -2.046362       NaN  0.557301
1  1.635631       NaN  0.925215
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [6]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [7]:
df.dropna()

          0         1         2
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [8]:
df

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [9]:
df.dropna(thresh=2) # drop rows with 2 or more NA

          0         1         2
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [10]:
df

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

### Filling In Missing Data

In [11]:
df.fillna(0)

          0         1         2
0 -2.046362  0.000000  0.000000
1  1.635631  0.000000  0.000000
2  0.487818  0.000000 -1.964850
3 -1.689219  0.000000  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [12]:
df

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [13]:
df.fillna({1: 0.5, 2: 0}) # Use a dictionary to fill with different values for the indicated col.

          0         1         2
0 -2.046362  0.500000  0.000000
1  1.635631  0.500000  0.000000
2  0.487818  0.500000 -1.964850
3 -1.689219  0.500000  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [14]:
df_new=df.copy()
df_new

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [15]:
df_new.columns=["one","two","three"]
df_new

        one       two     three
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [16]:
df

          0         1         2
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [28]:
df_new.fillna({"two": 0.5, "three": 0})
#df_new

        one       two     three
0 -2.046362  0.500000  0.000000
1  1.635631  0.500000  0.000000
2  0.487818  0.500000 -1.964850
3 -1.689219  0.500000  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [25]:
df_new

        one       two     three
0 -2.046362       NaN       NaN
1  1.635631       NaN       NaN
2  0.487818       NaN -1.964850
3 -1.689219       NaN  1.402107
4  0.776989  0.108152 -0.442500
5 -0.053905 -0.231494 -0.401336
6 -0.737848  0.388078  0.072028

In [ ]:
# pd.fillna(df_new,{1: 0.5, 2: 0})
# df_new

In [181]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532  0.584970  0.152677
3 -1.565657 -0.562540 -0.032664
4 -0.929006 -0.482573 -0.036264
5  1.095390  0.980928 -0.589488

In [182]:
df.iloc[2:, 1] = np.nan
df

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532       NaN  0.152677
3 -1.565657       NaN -0.032664
4 -0.929006       NaN -0.036264
5  1.095390       NaN -0.589488

In [186]:
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532       NaN  0.152677
3 -1.565657       NaN -0.032664
4 -0.929006       NaN       NaN
5  1.095390       NaN       NaN

In [193]:
df.fillna(method="ffill")
df

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532       NaN  0.152677
3 -1.565657       NaN -0.032664
4 -0.929006       NaN       NaN
5  1.095390       NaN       NaN

In [189]:
df.ffill()

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532  0.795253  0.152677
3 -1.565657  0.795253 -0.032664
4 -0.929006  0.795253 -0.032664
5  1.095390  0.795253 -0.032664

In [192]:

df.fillna(method="ffill", limit=2) # limit forward fill with 2 times.

          0         1         2
0  2.169461 -0.114928  2.003697
1  0.029610  0.795253  0.118110
2 -0.748532  0.795253  0.152677
3 -1.565657  0.795253 -0.032664
4 -0.929006       NaN -0.032664
5  1.095390       NaN -0.032664

In [42]:
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [43]:
df.ffill(limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [196]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
(1+3.5+7)/3

3.8333333333333335

Table 7.2: fillna function arguments
Argument|	Description
|:-------|:----------------------------------------------------------|
value	|Scalar value or dictionary-like object to use to fill missing values
method|	Interpolation method: one of "bfill" (backward fill) or "ffill" (forward fill); default is None
axis	|Axis to fill on ("index" or "columns"); default is axis="index"
limit	|For forward and backward filling, maximum number of consecutive periods to fill

## 7.2 Data Transformation

### Removing Duplicates

In [197]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [198]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [199]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [200]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [51]:
data.drop_duplicates(subset=["k1"]) # filter based on col "k1", keep the first occurence

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

`duplicated` and `drop_duplicates` by default keep the first observed value combination. Passing `keep="last"` will return the last one:

In [201]:
data.drop_duplicates(["k1", "k2"]) # keep the first duplicated by default

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [202]:
data.drop_duplicates(["k1", "k2"], keep="last")# keep the last duplicated

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [203]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [204]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [205]:
data["animal"] = data["food"].map(meat_to_animal) #[yw] elementawise mapping
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [58]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [59]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [206]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [207]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [208]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [209]:
data.replace([-999, -1000], np.nan) # replacing multiple values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [211]:
data.replace([-999, -1000], [np.nan, 0]) # use different replacment values

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [65]:
data.replace({-999: np.nan, -1000: 0}) # an alternative way

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [212]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

:::{.callout-note}
The `data.replace` method is distinct from `data.str.replace`, which performs element-wise string substitution. We look at these string methods on Series later in the chapter.

### Renaming Axis Indexes

In [213]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [214]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [215]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [216]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [71]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

If you want to create a transformed version of a dataset without modifying the original, a useful method is rename:

In [217]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [219]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [218]:
data1 = data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"}) # can use dictionary
data1

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [75]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [76]:
data1

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [220]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To do so, you have to use `pandas.cut`:

In [222]:
bins = [18, 25, 35, 60, 100] #bin edges
age_categories = pd.cut(ages, bins) # put ages into bins. 
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [223]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [224]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [225]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [227]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [228]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [229]:
pd.cut(ages, bins, right=False) # change to right side open, leftside closed

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [231]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names) # supply a group names

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If you pass an integer number of bins to pandas.cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data.

In [232]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2) # two decimal precision

[(0.014, 0.24], (0.7, 0.93], (0.7, 0.93], (0.014, 0.24], (0.24, 0.47], ..., (0.47, 0.7], (0.24, 0.47], (0.014, 0.24], (0.014, 0.24], (0.7, 0.93]]
Length: 20
Categories (4, interval[float64, right]): [(0.014, 0.24] < (0.24, 0.47] < (0.47, 0.7] < (0.7, 0.93]]

In [234]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2) 
#pandas.qcut uses sample quantiles instead, you will obtain roughly equally sized bins:
quartiles

[(-0.0092, 0.68], (-0.0092, 0.68], (-0.63, -0.0092], (0.68, 3.26], (0.68, 3.26], ..., (-0.0092, 0.68], (-0.0092, 0.68], (-3.76, -0.63], (-0.0092, 0.68], (-0.0092, 0.68]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.76, -0.63] < (-0.63, -0.0092] < (-0.0092, 0.68] < (0.68, 3.26]]

In [235]:
pd.value_counts(quartiles)

(-3.76, -0.63]      250
(-0.63, -0.0092]    250
(-0.0092, 0.68]     250
(0.68, 3.26]        250
Name: count, dtype: int64

In [236]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts() # specify quantiles

(-3.746, -1.335]      100
(-1.335, -0.00921]    400
(-0.00921, 1.303]     400
(1.303, 3.26]         100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [89]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.049091     0.026112    -0.002544    -0.051827
std       0.996947     1.007458     0.995232     0.998311
min      -3.645860    -3.184377    -3.745356    -3.428254
25%      -0.599807    -0.612162    -0.687373    -0.747478
50%       0.047101    -0.013609    -0.022158    -0.088274
75%       0.756646     0.695298     0.699046     0.623331
max       2.653656     3.525865     2.735527     3.366626

In [90]:
data

            0         1         2         3
0   -0.799318  0.777233 -0.612905  0.316447
1    0.838295 -1.034423  0.434304 -2.213133
2    0.758040  0.553933  0.339231 -0.688756
3   -0.815526 -0.332420  2.406483 -1.361428
4   -0.669619  0.781199 -0.395813 -0.180737
..        ...       ...       ...       ...
995 -0.856979 -0.446678  1.229042 -1.558031
996 -0.289339 -0.232531  0.409304 -0.813190
997  0.023646  0.232781 -0.345727  1.519174
998  1.060646 -1.456358  1.128420  0.032166
999 -0.485783  1.181563 -2.314042 -0.865834

[1000 rows x 4 columns]

In [91]:
col = data[2] # col with int-based index 2
col

0     -0.612905
1      0.434304
2      0.339231
3      2.406483
4     -0.395813
         ...
995    1.229042
996    0.409304
997   -0.345727
998    1.128420
999   -2.314042
Name: 2, Length: 1000, dtype: float64

In [92]:

col[col.abs() > 3]

41    -3.399312
136   -3.745356
Name: 2, dtype: float64

To select all rows having a value exceeding 3 or 3, you can use the any method on a Boolean DataFrame:

In [93]:
data[(data.abs() > 3).any(axis="columns")] # the () around data.abs()>3 is necessary

            0         1         2         3
41   0.457246 -0.025907 -3.399312 -0.974657
60   1.951312  3.260383  0.963301  1.201206
136  0.508391 -0.196713 -3.745356 -1.520113
235 -0.242459 -3.056990  1.918403 -0.578828
258  0.682841  0.326045  0.425384 -3.428254
322  1.179227 -3.184377  1.369891 -1.074833
544 -3.548824  1.553205 -2.186301  1.277104
635 -0.578093  0.193299  1.397822  3.366626
782 -0.207434  3.525865  0.283070  0.544635
803 -3.645860  0.255475 -0.549574 -1.907459

In [94]:
np.sign(-1.3)

-1.0

In [95]:
np.sign(data)

       0    1    2    3
0   -1.0  1.0 -1.0  1.0
1    1.0 -1.0  1.0 -1.0
2    1.0  1.0  1.0 -1.0
3   -1.0 -1.0  1.0 -1.0
4   -1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995 -1.0 -1.0  1.0 -1.0
996 -1.0 -1.0  1.0 -1.0
997  1.0  1.0 -1.0  1.0
998  1.0 -1.0  1.0  1.0
999 -1.0  1.0 -1.0 -1.0

[1000 rows x 4 columns]

In [96]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.050286     0.025567    -0.001399    -0.051765
std       0.992920     1.004214     0.991414     0.995761
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.599807    -0.612162    -0.687373    -0.747478
50%       0.047101    -0.013609    -0.022158    -0.088274
75%       0.756646     0.695298     0.699046     0.623331
max       2.653656     3.000000     2.735527     3.000000

In [97]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is possible using the numpy.random.permutation function. Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [98]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [99]:
sampler = np.random.permutation(5)
sampler

array([3, 1, 4, 2, 0])

That array can then be used in `iloc`-based indexing or the equivalent `take` function:

In [100]:
df.take(sampler) # rows are sampled according to the indices in sampler

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [101]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [102]:
column_sampler = np.random.permutation(7)
column_sampler

array([4, 6, 3, 2, 1, 0, 5])

In [103]:
df.take(column_sampler, axis="columns") #by col

    4   6   3   2   1   0   5
0   4   6   3   2   1   0   5
1  11  13  10   9   8   7  12
2  18  20  17  16  15  14  19
3  25  27  24  23  22  21  26
4  32  34  31  30  29  28  33

To select a random subset without replacement (the same row cannot appear twice), you can use the sample method on Series and DataFrame:

In [104]:
df.sample(n=3) #without replacement

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [105]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

2   -1
0    5
3    6
1    7
4    4
0    5
4    4
0    5
4    4
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [106]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

If a column in a DataFrame has k distinct values, you would derive a matrix or DataFrame with k columns containing all 1s and 0s. pandas has a `pandas.get_dummies` function for doing this, though you could also devise one yourself.

Here I passed `dtype=float` to change the output type from boolean (the default in more recent versions of pandas) to floating point.

In [107]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [108]:
pd.get_dummies(df["key"])#, dtype=float)

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In some cases, you may want to add a prefix to the columns in the indicator DataFrame, which can then be merged with the other data. pandas.get_dummies has a prefix argument for doing this:

In [109]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [110]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [111]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

`names=mnames`: pass the col names

`engine="python"`: This parameter specifies the parsing engine. In this case, the "python" engine is being used to parse the data. The "python" engine is typically slower than the underlying C engine but is more flexible in handling certain types of files, such as those with irregular delimiters.

pandas has implemented a special Series method `str.get_dummies` (methods that start with str. are discussed in more detail later in String Manipulation) that handles this scenario of multiple group membership encoded as a delimited string:

In [112]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [113]:
movies_windic = movies.join(dummies.add_prefix("Genre_")) # combine with original dataset
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

A useful recipe for statistical applications is to combine pandas.get_dummies with a discretization function like pandas.cut:

In [114]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

array([0.9296, 0.3164, 0.1839, 0.2046, 0.5677, 0.5955, 0.9645, 0.6532,
       0.7489, 0.6536])

In [115]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [116]:

pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

## 7.3 Extension Data Types (advanced)

In [117]:
s = pd.Series([1, 2, 3])#, None])
s

0    1
1    2
2    3
dtype: int64

In [118]:
s = pd.Series([1, 2, 3, None]) #after adding None, dtype becomes float64
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [119]:
s.dtype

dtype('float64')

In [120]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [121]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [122]:
s.dtype

Int64Dtype()

In [123]:
s[3]

In [124]:

s[3] is pd.NA

True

We also could have used the shorthand "`Int64`" instead of `pd.Int64Dtype()` to specify the type. The capitalization is necessary, otherwise it will be a NumPy-based nonextension type:

In [125]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [126]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype()) #extension string type
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [127]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      object
 2   C       3 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [129]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      Int64
 1   B       3 non-null      string
 2   C       3 non-null      boolean
dtypes: Int64(1), boolean(1), string(1)
memory usage: 208.0 bytes

Table 7.3: pandas extension data types

Extension type|	Description
|:----------------|:------------------------------------------------------------------|
BooleanDtype|	Nullable Boolean data, use "boolean" when passing as string
CategoricalDtype|	Categorical data type, use "category" when passing as string
DatetimeTZDtype|	Datetime with time zone
Float32Dtype	|32-bit nullable floating point, use "Float32" when passing as string
Float64Dtype|	64-bit nullable floating point, use "Float64" when passing as string
Int8Dtype	|8-bit nullable signed integer, use "Int8" when passing as string
Int16Dtype|	16-bit nullable signed integer, use "Int16" when passing as string
Int32Dtype	|32-bit nullable signed integer, use "Int32" when passing as string
Int64Dtype	|64-bit nullable signed integer, use "Int64" when passing as string
UInt8Dtype	|8-bit nullable unsigned integer, use "UInt8" when passing as string
UInt16Dtype|	16-bit nullable unsigned integer, use "UInt16" when passing as string
UInt32Dtype|	32-bit nullable unsigned integer, use "UInt32" when passing as string
UInt64Dtype	|64-bit nullable unsigned integer, use "UInt64" when passing as string

## 7.4 String Manipulation

### Python Built-In String Object Methods

In [131]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

`split` is often combined with `strip` to trim whitespace (including line breaks):

In [132]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [133]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [134]:
"::".join(pieces)

'a::b::guido'

Other methods are concerned with locating substrings. Using Pythons in keyword is the best way to detect a substring, though index and find can also be used:

In [135]:
val

'a,b,  guido'

In [136]:
"guido" in val

True

In [137]:
val.index(",")

1

In [138]:


val.find(":")

-1

Note that the difference between find and index is that index raises an exception if the string isnt found (versus returning 1):

In [139]:
val.index(":")

ValueError: substring not found

In [ ]:
val.count(",")

2

In [ ]:
val.replace(",", "::")

'a::b::  guido'

In [ ]:
val

'a,b,  guido'

In [ ]:

val.replace(",", "")

'ab  guido'

Table 7.4: Python built-in string methods
Method	|Description
|:---------------------|:--------------------------------------------------------------------|
count|	Return the number of nonoverlapping occurrences of substring in the string
endswith|	Return True if string ends with suffix
startswith|	Return True if string starts with prefix
join	|Use string as delimiter for concatenating a sequence of other strings
index|	Return starting index of the first occurrence of passed substring if found in the string; otherwise, raises ValueError if not found
find|	Return position of first character of first occurrence of substring in the string; like index, but returns 1 if not found
rfind	|Return position of first character of last occurrence of substring in the string; returns 1 if not found
replace|	Replace occurrences of string with another string
strip, rstrip, lstrip	|Trim whitespace, including newlines on both sides, on the right side, or on the left side, respectively
split	|Break string into list of substrings using passed delimiter
lower|	Convert alphabet characters to lowercase
upper|	Convert alphabet characters to uppercase
casefold	|Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form
ljust, rjust|	Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width

In [ ]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text) # 1 or more space

['foo', 'bar', 'baz', 'qux']

When you call `re.split(r"\s+", text)`, the regular expression is first compiled, and then its split method is called on the passed text. You can compile the regex yourself with `re.compile`, forming a reusable regex object:

In [ ]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
text

'foo    bar\t baz  \tqux'

In [ ]:
regex.findall(text)

['    ', '\t ', '  \t']

:::{.callout-note}
To avoid unwanted escaping with `\` in a regular expression, use raw string literals like `r"C:\x"` instead of the equivalent `"C:\\x"`.

`match` and `search` are closely related to `findall`. While `findall` returns all matches in a string, `search` returns only the first match. More rigidly, `match` only matches at the beginning of the string. As a less trivial example, lets consider a block of text and a regular expression capable of identifying most email addresses:

In [ ]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"
# [A-Z0-9._%+-]+ matches one or more occurrences of uppercase letters, digits, 
# and certain special characters including period (.), underscore (_), percentage (%), plus (+), and hyphen (-).

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [ ]:
m = regex.search(text)
m

In [ ]:
m.start(),m.end()

(5, 20)

In [ ]:
text[m.start():m.end()]

'dave@google.com'

`regex.match` returns `None`, as it will match only if the pattern occurs at the start of the string:

In [ ]:
print(regex.match(text))

None

In [ ]:
print(regex.sub("REDACTED", text)) #sub will return a new string with occurrences of the pattern replaced by a new string

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suppose you wanted to find email addresses and simultaneously segment each address into its three components: username, domain name, and domain suffix. To do this, put parentheses around the parts of the pattern to segment:

In [ ]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [ ]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

`sub` also has access to groups in each match using special symbols like `\1` and `\2`. The symbol `\1` corresponds to the first matched group, `\2` corresponds to the second, and so forth:

In [ ]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

Table 7.5: Regular expression methods
Method	|Description
|:-------------|:---------------------------------------------------------------------|
findall	|Return all nonoverlapping matching patterns in a string as a list
finditer	|Like findall, but returns an iterator
match	|Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches, return a match object, and otherwise None
search|	Scan string for match to pattern, returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning
split	|Break string into pieces at each occurrence of pattern
sub, subn|	Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string

### String Functions in pandas

In [ ]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [ ]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

String and regular expression methods can be applied (passing a lambda or other function) to each value using `data.map`, but it will fail on the `NA` (null) values. To cope with this, Series has array-oriented methods for string operations that skip over and propagate `NA` values. These are accessed through Seriess `str` attribute; for example, we could check whether each email address has "gmail" in it with `str.contains`:

In [ ]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

Note that the result of this operation has an `object` dtype. pandas has extension types that provide for specialized treatment of strings, integers, and Boolean data which until recently have had some rough edges when working with missing data:

In [ ]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [ ]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [ ]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [ ]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

There are a couple of ways to do vectorized element retrieval. Either use `str.get` or index into the `str` attribute:

In [ ]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [ ]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [ ]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [ ]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

The `str.extract` method will return the captured groups of a regular expression as a DataFrame:

In [ ]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

Table 7.6: Partial listing of Series string methods
Method	|Description
|:---------------|:---------------------------------------------------------------------|
cat	|Concatenate strings element-wise with optional delimiter
contains|	Return Boolean array if each string contains pattern/regex
count	|Count occurrences of pattern
extract	|Use a regular expression with groups to extract one or more strings from a Series of strings; the result will be a DataFrame with one column per group
endswith|	Equivalent to x.endswith(pattern) for each element
startswith	|Equivalent to x.startswith(pattern) for each element
findall	|Compute list of all occurrences of pattern/regex for each string
get	|Index into each element (retrieve i-th element)
isalnum	|Equivalent to built-in str.alnum
isalpha	|Equivalent to built-in str.isalpha
isdecimal|	Equivalent to built-in str.isdecimal
isdigit|	Equivalent to built-in str.isdigit
islower|	Equivalent to built-in str.islower
isnumeric|	Equivalent to built-in str.isnumeric
isupper|	Equivalent to built-in str.isupper
join|	Join strings in each element of the Series with passed separator
len	|Compute length of each string
lower, upper|	Convert cases; equivalent to x.lower() or x.upper() for each element
match|	Use re.match with the passed regular expression on each element, returning True or False whether it matches
pad	|Add whitespace to left, right, or both sides of strings
center|	Equivalent to pad(side="both")
repeat|	Duplicate values (e.g., s.str.repeat(3) is equivalent to x * 3 for each string)
replace	|Replace occurrences of pattern/regex with some other string
slice	|Slice each string in the Series
split	|Split strings on delimiter or regular expression
strip|	Trim whitespace from both sides, including newlines
rstrip	|Trim whitespace on right side
lstrip	|Trim whitespace on left side

## Categorical Data

In [ ]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [ ]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [ ]:
pd.value_counts(values)

C:\Users\Yi\AppData\Local\Temp\ipykernel_25452\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In data warehousing, a best practice is to use so-called dimension tables containing the distinct values and storing the primary observations as integer keys referencing the dimension table:

In [ ]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [ ]:
dim # contains the distinct values

0     apple
1    orange
dtype: object

We can use the `take` method to restore the original Series of strings:

In [ ]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [ ]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
N

8

In [ ]:
fruits

['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']

In [ ]:
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N), # [3,15) between 3(inclusive) and 15(exclusive) with discrete uniform distribution
                   'weight': rng.uniform(0, 4, size=N)}, # [0,4) 0(inlcusive) 4(exclusive)
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   basket_id  8 non-null      int32
 1   fruit      8 non-null      object
 2   count      8 non-null      int64
 3   weight     8 non-null      float64
dtypes: float64(1), int32(1), int64(1), object(1)
memory usage: 356.0+ bytes

In [ ]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [ ]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [ ]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [ ]:

c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [ ]:
dict(enumerate(c.categories)) #A useful trick to get a mapping between codes and categories

{0: 'apple', 1: 'orange'}

You can convert a DataFrame column to categorical by assigning the converted result:

In [ ]:
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

You can also create `pandas.Categorical` directly from other types of Python sequences:

In [ ]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

If you have obtained categorical encoded data from another source, you can use the alternative `from_codes` constructor:

In [ ]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

Unless explicitly specified, categorical conversions assume no specific ordering of the categories. So the categories array may be in a different order depending on the ordering of the input data. When using `from_codes` or any of the other constructors, you can indicate that the categories have a meaningful ordering:

In [ ]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

The output `[foo < bar < baz]` indicates that 'foo' precedes 'bar' in the ordering, and so on. An unordered categorical instance can be made ordered with as_ordered:

In [ ]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

### Computations with Categoricals

In [ ]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.4238,  1.2637, -0.8707, -0.2592, -0.0753])

In [ ]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [ ]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [ ]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

The labeled bins categorical does not contain information about the bin edges in the data, so we can use groupby to extract some summary statistics:

In [ ]:
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [ ]:
bins = pd.Series(bins, name='quartile')
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [ ]:
draws

array([-1.4238,  1.2637, -0.8707, -0.2592, -0.0753, -0.7409, -1.3678,
        0.6489,  0.3611, -1.9529,  2.3474,  0.9685, -0.7594,  0.9022,
       -0.467 , -0.0607,  0.7888, -1.2567,  0.5759,  1.399 ,  1.3223,
       -0.2997,  0.9029, -1.6216, -0.1582,  0.4495, -1.3436, -0.0817,
        1.7247,  2.6182,  0.7774,  0.8286, -0.959 , -1.2094, -1.4123,
        0.5415,  0.7519, -0.6588, -1.2287,  0.2576,  0.3129, -0.1308,
        1.27  , -0.093 , -0.0662, -1.1082,  0.136 ,  1.3471,  0.0611,
        0.0709,  0.4337,  0.2775,  0.5303,  0.5367,  0.6184, -0.795 ,
        0.3   , -1.6027,  0.2668, -1.2616, -0.0713,  0.474 , -0.4149,
        0.0977, -1.6404, -0.8573,  0.6883, -1.1545,  0.6505, -1.3884,
       -0.9074, -1.0954,  0.0071,  0.5344, -1.0658, -0.1815,  1.622 ,
       -0.3174, -0.8158,  0.3866, -0.2236, -0.7017, -1.7957,  0.8183,
       -0.571 ,  0.0008, -1.0636,  1.3017,  0.7479,  0.9809, -0.1104,
        0.4679,  0.8906,  1.023 ,  0.3124, -0.0619, -0.3595, -0.7486,
       -0.9655,  0.36  , -0.2446, -1.9959, -0.1552,  1.0638, -0.2752,
       -1.8533, -0.1243,  0.785 ,  0.202 , -0.4281,  1.8483,  1.9   ,
       -0.0984,  0.8134,  0.3925,  0.7814,  1.4533,  0.8202,  0.0877,
       -0.6535, -0.8119, -0.0255,  1.1582,  0.3005,  0.0531,  0.2573,
        0.0357,  0.5472, -1.123 , -1.9752, -0.4252, -1.1491,  1.6151,
       -0.1585, -0.2529, -1.5382,  0.2821, -0.6236,  1.1218,  0.8412,
       -0.7759,  0.4107, -2.7224, -0.6733,  1.2462,  0.7902,  0.1753,
       -0.0293, -1.4195, -1.36  ,  0.2234,  1.7618, -2.1709,  0.6285,
        0.6012,  0.9508, -0.8692, -0.529 ,  0.0457, -1.0276, -1.2293,
       -0.8834, -0.0709,  0.3741, -0.0246,  0.0773, -0.6839, -0.7208,
        1.1206, -0.0548, -0.0824,  0.936 ,  1.2385,  1.2728,  0.4059,
       -0.0503,  0.2893,  0.1793,  1.3975,  0.292 ,  0.6384, -0.0279,
        1.3711, -2.0528,  0.3805,  0.7554, -1.1591,  2.1503, -0.1503,
       -0.1612, -1.0794,  0.878 ,  0.2245, -0.5916,  0.2263,  0.6862,
        1.215 ,  0.2161, -0.9648, -0.5566, -2.2984, -0.7321,  0.7365,
        0.4657, -0.1079, -0.3414,  1.5845,  0.2822,  0.9095,  0.3951,
       -0.6694,  1.5554, -1.2381, -1.1962, -0.4291, -0.7297, -0.5575,
       -0.6   ,  0.9868,  0.0542,  0.3519, -1.588 , -0.847 ,  1.0846,
       -1.2038,  1.1785, -1.0307,  0.2992, -0.8462,  0.1966, -0.8996,
       -0.2566,  1.6725, -0.3753,  2.0368, -0.4588, -1.1758,  0.0751,
       -0.409 ,  1.7565,  0.8609,  1.1813,  0.6317,  2.471 ,  0.7943,
        0.5314, -0.8294, -0.9093,  0.1842,  0.9977,  1.117 , -0.944 ,
        0.5314,  0.1933, -1.1183,  0.5118, -2.2706,  0.2632,  2.4713,
       -1.0199,  0.0188, -1.8943, -0.755 ,  0.7562, -1.0425, -0.0343,
       -0.3552, -0.3784,  0.1906,  0.4844,  1.2303,  0.833 , -0.5649,
        1.4147,  1.2483, -1.5589,  0.6652,  0.8256,  0.9663,  0.5472,
       -1.2972, -0.2676, -2.0702, -0.1579,  2.0289,  0.6816,  0.8362,
       -0.5135, -1.0157, -1.0703,  0.1239, -0.803 , -0.6376,  1.1445,
       -1.6409, -1.314 , -0.5104, -0.0999, -0.1295, -1.3967,  0.1938,
       -0.1293,  0.3545, -1.0829,  0.2449,  0.2208, -0.6604, -0.2185,
       -0.556 ,  1.3564, -3.1196, -1.4477, -1.7058, -0.3781, -0.6785,
       -0.4112,  0.719 , -1.6325, -0.8457, -0.2231, -1.2022,  0.37  ,
        0.33  , -0.7104, -1.7711,  1.6008,  0.4711,  0.4238,  0.0723,
       -0.0073,  0.8311, -0.0156, -0.6309,  0.7095,  0.0597, -0.7725,
       -0.9062,  1.1655,  0.631 ,  1.9755, -0.5267, -0.7435,  0.4039,
        1.3794,  0.5968,  0.4332,  1.887 , -0.7434, -1.2479, -0.7446,
       -0.3169,  0.3734,  1.022 ,  0.4056,  1.5233, -0.8275,  1.9055,
       -0.812 ,  1.1707, -0.9378,  0.3433,  0.0509,  0.5176,  0.7514,
       -0.2132, -0.0668,  0.2391, -1.305 , -0.7312, -1.6244,  0.0053,
        2.2222,  0.7413, -0.8654, -0.7077,  0.9759, -0.4744, -1.6085,
       -1.0229, -1.0543, -1.0214,  0.676 ,  0.0707, -1.4886, -0.5398,
       -1.1383, -1.2084, -1.5067,  1.7472, -0.3073,  0.5762,  0.8687,
       -0.3843,  0.5349,  0.5406,  0.2225,  2.1695,  0.2839, -0.2285,
        0.6462,  1.778 ,  0.9943, -0.4783, -0.8588, -0.9309, -0.6619,
        0.3865,  0.846 , -2.2699, -0.0187, -1.105 ,  0.6829,  0.9145,
       -0.7784, -0.4494, -0.9516,  0.3911, -1.61  , -1.1256, -0.6846,
        1.2265,  2.4025,  0.02  , -1.2316,  0.0742, -0.869 ,  0.4598,
       -1.1137, -0.3695, -0.0141,  0.5199, -0.0769,  1.2659,  0.1242,
       -1.8138,  0.9241, -0.2911, -0.6698,  1.5077, -0.9936,  0.0727,
       -0.713 ,  1.3524, -0.364 ,  0.2357, -1.3923,  1.4347, -1.0695,
        0.9105,  1.1137,  1.2323,  1.8141, -1.1707,  0.402 ,  0.138 ,
        0.4199,  1.0983,  0.1094, -0.8169, -0.0973,  1.5392, -1.179 ,
        0.0797, -0.9813,  1.1088, -1.6484, -0.3411, -0.1242,  0.1169,
        2.3612,  1.5552, -1.0299,  2.1594, -1.1925, -1.8709, -1.4985,
        0.2035,  0.5349, -2.2111,  0.436 , -0.2671,  0.7064, -0.3846,
        0.9001,  0.5643, -1.1726,  1.4456,  0.2124,  0.73  ,  1.2618,
       -0.9748, -0.0847, -0.8217, -0.9424,  0.266 ,  0.3398,  1.3314,
        1.3855, -0.0214, -0.8371,  3.2007,  2.1479, -0.1067, -0.9302,
       -0.4237,  0.281 ,  1.1316,  0.9694,  0.4354, -0.2471,  0.1682,
       -0.3106,  0.0709, -0.1034,  0.5253, -1.8827, -0.3457, -0.2913,
       -1.1306, -0.1727, -1.0535, -0.6646, -0.2897, -0.2532, -0.5738,
        1.1035,  0.2012,  0.3224,  0.2331, -0.6681, -0.8832,  0.8396,
       -0.3531, -1.7711, -2.1988,  0.2218, -0.7371, -0.0676, -0.5473,
       -0.4074, -0.1727, -1.2474, -0.0188,  0.9861,  0.6957, -1.7396,
       -1.3416, -1.3328, -0.2481,  0.8548,  0.323 , -1.7536,  0.0549,
        0.8074, -0.449 ,  1.9042, -0.6515,  1.1725,  2.3512, -1.2764,
       -0.3237,  0.5747,  3.2114, -1.7885,  0.5661,  0.2848, -0.4224,
       -0.8349, -0.5259, -0.3031, -1.2699,  1.5755, -1.1085, -0.4275,
       -0.6615, -0.4133,  0.093 , -0.7576, -0.2361,  1.7245,  1.0562,
       -0.288 ,  0.9072, -0.7685,  0.2259, -1.4285, -1.1441, -0.8666,
        1.2375,  0.2307,  0.5478,  0.1517,  0.3669,  0.4195,  0.7653,
        0.1613, -0.916 , -0.7909,  1.2142,  1.4118,  0.5594, -1.6449,
        1.5752,  0.3229, -0.0745,  0.0197, -0.3727,  1.7583,  1.6826,
       -1.0648, -0.1898,  0.3034,  1.2757, -2.4296,  0.9306,  1.6678,
       -0.3341, -0.0515,  1.2433,  0.367 , -1.3462, -1.1819, -1.045 ,
       -1.4324, -0.0201, -0.5342,  0.0269,  0.6927,  1.7746,  0.2021,
       -1.8808,  1.3788, -0.1336,  1.1517, -0.4664,  0.2886, -0.1512,
       -0.0421,  1.2621, -0.6727,  0.1475,  0.2038, -0.4062, -2.222 ,
        0.3318, -2.8605, -1.5234, -0.478 ,  0.4127,  0.8464,  0.8121,
        0.5806, -0.3811,  1.201 , -0.2838,  1.1071, -2.2561, -0.9719,
       -0.5929, -0.0181, -2.4127,  0.7992,  0.9761,  0.7731, -0.5332,
        1.4415, -0.564 ,  0.8935, -0.0743, -0.0346, -0.1708, -0.0366,
        1.0981,  1.4263,  1.4147,  0.8944,  0.6537,  0.4372,  1.7464,
       -0.4571, -0.6493,  0.033 , -1.685 , -0.2526, -0.074 , -1.0442,
       -0.5928,  0.6802, -0.246 ,  0.0606,  1.0197, -0.6301, -1.1604,
       -0.0569,  0.4093, -1.8297,  0.642 , -0.3297, -0.4293, -0.8769,
       -0.1996,  0.9503,  0.5139,  0.7978, -0.3781,  1.5822,  1.2657,
       -0.0297, -2.6398,  0.0511,  2.7478, -0.0641, -1.0302,  1.6991,
       -0.6237,  0.4875,  0.759 , -1.4797,  0.1212,  1.1886, -0.3334,
        0.6491, -0.0268,  1.025 ,  1.8482, -1.103 , -0.2904,  0.3916,
       -0.6352, -0.83  , -0.3498, -0.273 , -0.6579,  0.3269,  0.8065,
        0.7453,  0.6794,  1.1925, -1.3668, -0.1166,  0.189 ,  0.5258,
       -1.6161,  1.8807, -0.8906,  0.2641,  0.7373,  1.0868, -0.6864,
       -0.5418,  0.3712,  0.5875,  0.9122, -0.0558, -0.6938, -1.3347,
        1.7464, -1.3734,  0.7012,  0.2801,  0.7644,  0.9565,  1.3526,
       -0.0558,  0.4001, -1.9514,  0.0488, -0.9045, -0.1503,  1.2414,
        0.1107,  1.0952, -0.1967,  0.4045, -0.409 , -2.5413, -0.709 ,
       -0.2616,  0.1626,  0.008 , -0.1207,  0.9542,  0.6316, -0.3915,
        0.8785, -1.9796, -0.2758, -0.1403,  1.3107, -0.5285, -1.4638,
        0.1857,  1.7025, -0.1995, -0.0889, -0.1946,  0.0627,  1.3143,
        1.9753,  0.4833, -0.0918,  1.8663,  0.1124,  0.0796, -0.3438,
       -0.3012,  0.2554, -0.2727,  0.4332,  0.1072,  0.5713, -0.3658,
       -0.1841,  0.2596,  0.0845,  0.1162,  1.1862, -1.0559, -1.9253,
        0.7411, -0.2256,  1.3656, -0.0692, -1.153 ,  2.2097,  0.4165,
       -0.4364, -0.736 ,  0.5774, -0.6615,  0.4047,  1.1789, -1.3746,
       -0.3423,  0.4932,  1.6742,  0.9432, -0.4416,  1.4748, -0.3457,
       -0.15  ,  0.3899, -1.0831,  3.0855,  1.2088,  0.2302, -0.5578,
       -1.1485,  0.382 ,  0.7044, -0.3889, -0.1855,  0.5663, -0.0514,
       -1.8462,  0.6746,  0.252 ,  0.7381, -0.7475, -2.1173, -1.2407,
        0.3052,  2.0856,  2.3595,  0.3095, -1.4513, -0.3301,  0.4528,
        0.4423,  0.1005,  1.3445, -0.8936, -2.1607, -0.8722, -1.1568,
        2.2383, -0.1811, -1.4233,  0.6218,  1.0115,  0.0581,  0.1974,
        1.0284,  0.5193, -0.695 ,  0.5937,  0.9332,  0.3464,  0.8773,
        0.5889, -0.2322, -0.1428,  0.6176, -0.5499,  1.1553,  1.2221,
       -2.0289, -0.0668, -0.748 , -0.6314,  0.1476, -0.1667,  0.5673,
        0.324 ,  0.3728, -0.7809, -0.3463,  1.4606, -2.4776,  1.7195,
       -0.5593,  1.181 , -2.5935, -0.4172,  0.8498,  0.1512,  1.017 ,
       -0.8737, -0.5584, -0.6528,  0.5087,  0.4636, -0.1215, -0.2629,
       -0.2908,  0.0882, -0.9472, -0.0558, -0.1426, -0.5388, -0.5688,
        1.4784, -0.6133,  0.4132,  1.369 ,  0.7414,  0.0212,  1.0148,
       -1.4245, -1.2298, -0.3954, -0.2192, -0.0946,  1.8808,  1.689 ,
       -0.0371,  0.2561, -0.9063,  0.3198, -1.3415,  1.4003, -0.5182,
        0.5584, -1.3055,  1.392 ,  0.6121,  1.9603,  0.0688, -1.6193,
       -0.7837, -1.255 ,  1.5789, -0.624 , -0.7521,  0.5961,  0.2669,
        0.4933, -0.5015, -1.9977, -1.3587, -2.1955,  1.2812,  0.9107,
       -0.3737,  0.6245,  0.674 ,  0.637 ,  0.533 ,  0.885 ,  0.0832,
       -2.2198, -2.7671,  1.2661,  0.5985, -2.5131,  0.1756, -0.8779,
       -0.5471, -2.6036,  0.773 , -0.0834,  0.8184,  1.0909,  1.2914,
        1.6515,  0.2939,  0.2191, -0.6379,  0.5309, -0.2372])

In [ ]:
pd.Series(draws)

0     -1.423825
1      1.263728
2     -0.870662
3     -0.259173
4     -0.075343
         ...
995    0.293890
996    0.219100
997   -0.637850
998    0.530894
999   -0.237212
Length: 1000, dtype: float64

In [ ]:
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

`.agg(['count', 'min', 'max']`: This part aggregates the grouped data by computing the count, minimum, and maximum values for each group. It applies the count, min, and max functions to each group, generating a DataFrame with the aggregated results.

In [ ]:
pd.Series(draws).groupby(bins)

C:\Users\Yi\AppData\Local\Temp\ipykernel_25452\3698549966.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  pd.Series(draws).groupby(bins)

In [ ]:
(pd.Series(draws)  # The outer enclosing () is used to write multiple line code. 
           .groupby(bins) #group by the values in bins
           .agg(['count', 'min', 'max']))

C:\Users\Yi\AppData\Local\Temp\ipykernel_25452\22020694.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins) #group by the values in bins

          count       min       max
quartile
Q1          250 -3.119609 -0.678494
Q2          250 -0.673305  0.008009
Q3          250  0.018753  0.686183
Q4          250  0.688282  3.211418

In [ ]:

results = (pd.Series(draws)  # The outer enclosing () is used to write multiple line code. 
           .groupby(bins) #group by the values in bins
           .agg(['count', 'min', 'max']) # 
           .reset_index()) # reset index starting from 0, and change the old index to a column
results

C:\Users\Yi\AppData\Local\Temp\ipykernel_25452\3600643907.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

The `'quartile'` column in the result retains the original categorical information, including ordering, from bins:

In [ ]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

### Better performance with categoricals

In [ ]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [ ]:
categories = labels.astype('category')

In [ ]:
labels.memory_usage(deep=True) #memory usage for both data and indices
# When deep is set to False, it only calculates the memory usage of the data and does not include the memory usage of the indices.

600000132

In [ ]:
categories.memory_usage(deep=True)

10000544

In [ ]:
%time _ = labels.astype('category') # _: not using the output. %time measure time with single execution

CPU times: total: 484 ms
Wall time: 497 ms

In [ ]:
%timeit labels.value_counts()  #%timeit: measure time with multiple excecution
%timeit categories.value_counts()

349 ms  5.81 ms per loop (mean  std. dev. of 7 runs, 1 loop each)
45.9 ms  1.05 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

### Categorical Methods

In [ ]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

Series containing categorical data have several special methods similar to the `Series.str` specialized string methods. This also provides convenient access to the categories and codes. 

The special accessor attribute `cat` provides access to categorical methods:

In [ ]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [ ]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

Suppose that we know the actual set of categories for this data extends beyond the four values observed in the data. We can use the set_categories method to change them:

In [ ]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [ ]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [ ]:

cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [ ]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

There are two unused categories.

In [ ]:

cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

Table 7.7: Categorical methods for Series in pandas
Method	|Description
|:---------|:---------------------------------------------------------------|
add_categories|	Append new (unused) categories at end of existing categories
as_ordered	|Make categories ordered
as_unordered	|Make categories unordered
remove_categories|	Remove categories, setting any removed values to null
remove_unused_categories|	Remove any category values that do not appear in the data
rename_categories	|Replace categories with indicated set of new category names; cannot change the number of categories
reorder_categories|	Behaves like rename_categories, but can also change the result to have ordered categories
set_categories|	Replace the categories with the indicated set of new categories; can add or remove categories

### Creating dummy variables for modeling

In [ ]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [ ]:
pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS